let a=1;
let b=2;
let i=0;
while(i<10){
    let c = a+b;
    console.log(a); 
    a = b;
    b=c;
    
    i++
}



// let sum=0;
// for (let i =100;i<300;i++){
    
//     if (i % 3 === 0) {
//         sum++;
//         console.log(i)
//         if (sum % 5 === 0) {
//         console.log (i)
//         }
//     }
// }




// function znak() {
  
// let arg = prompt("Введите знак?");
// switch (arg) {

//   case 'Овен':
//     alert( 'Сегодня Овны могут почувствовать потолок, который будет сложно пробить. Но не сдавайтесь – пробуйте вновь и вновь, и тогда прошибёте его.' );
//     break;

//   case 'Телец':
//     alert( 'Сегодня Тельцам стоит держаться подальше от новых задач – они будут неподъемными. Переложите их на завтра-послезавтра – тогда у вас будет больше сил с ними справиться.' );
//     break;

//   case 'Близницы':
//     alert( 'Сегодня Близнецам нужен четкий план и его мелкие детали – если играть по сценарию, то успех не заставит себя долго ждать.' );
//     break;

//     case 'Рак':
//     alert( 'Сегодня Раки – консерваторы. Они хотят пользоваться только старыми методами, опираться лишь на проверенных товарищей.' );
//     break;
    
//     case 'Лев':
//     alert( 'Сегодня Львам стоит проверить все документы и работу в целом на ошибки – возможно, где-то вы промахнулись. Но в этом нет ничего криминального – вы можете все исправить.' );
//     break;

//     case 'Дева':
//     alert( 'Сегодня у Дев миссия: не только не испортить отношения, но и сделать их крепче. И поверьте нам, у вас все получится.' );
//     break;

//     case 'Весы':
//     alert( 'Сегодня Весам очень важно позаботиться о своем здоровье – иммунитет ползет вниз, как и ваше настроение.' );
//     break;

//     case 'Скорпион':
//     alert( 'Сегодня у Скорпионов просто крутой день – все будет идти по плану, вы будете добиваться желаемого.' );
//     break;

//     case 'Стрелец':
//     alert( 'Сегодня Стрельцы будут нелюдимы, но это даже на пользу – сейчас вам не стоит много говорить, можете ляпнуть что-то не то и подпортить жизнь и себе, и близким.' );
//     break;

//     case 'Козерог':
//     alert( 'Сегодня у Козерогов просто обалденный день – все будет идти по плану, а окружающие будут только радовать.' );
//     break;

//     case 'Водолей':
//     alert( 'Сегодня Водолеям стоит переоценить свои ценности, поставить новые цели – это откроет перед вами ряд возможностей.' );
//     break;

//     case 'Рыбы':
//     alert( 'Сегодня Рыбам крупно везет. Наслаждайтесь этим временем и старайтесь все везде успеть – удача будет не бесконечной.' );
//     break;

    
//   default:
//     alert(  'Нето ввел!' );
// }
// }
// znak();




// let sum =data + mount;

// function data1 (){
//   const data = prompt('Введите дату рождения');
//   const mount = prompt('Введите месяц рождения');
//   const sum = data + mount;
//   console.log(sum)

//   alert (`Ваше родовое число , ${sum}`);

// }
// data1();



// function koffe(){

// do{
//   const sugar = confirm('Добавить ли сахар');
//   if (sugar){
//     let i = prompt("Колличество ложек сахара");
//     alert(`Ложек сахара в кофе = ${i} `);
//   } else{
//     alert("Приятного аппетита")
//   }
  
// } while(sugar);

// }
// koffe()  